---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures
source: html/b7cff755-7fb3-8f56-1a74-ab95fc488a99.htm
---
# BuiltInFailures.WallJoinRoofFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.